import fran from '../img/fran.jfif'
import efra from '../img/efra.jpg'
import emili from '../img/emili2.jpg'
import larica from '../img/larica.webp'
import buylo from '../img/buylo2.jpg'

const data =[
    {
        id:1,
        name:'ЕФРОСИНЬЯ ПОЛОЦКАЯ',
        year:'1104 - 1167',
        text:[
            {main:'Предслава получила сравнительно хорошее для того времени домашнее образование. В 12-летнем возрасте отец хотел выдать её замуж. Княжна, однако, отказалась не только от брака, но и вообще от светской жизни и тайно приняла постриг в Полоцком монастыре (исследователь «Жития» Алексей Мельников полагает, что это произошло 15 февраля 1116). Причины такого поступка неизвестны.'},
            {bio:'Предслава, будучи дочерью витебского князя Святослава Всеславича, отказаласьот своего статуса и выбрала другую судьбу: в 12 лет она приняла монашескийпостриг под именем Евфросинья и поселилась в келье Софийского собора.Она занималась просветительской и миротворческой деятельностью, а одним из еёобетов стало переписывание книг — нелёгкий труд для девушки, так как писатьприходилось на весу, на левой ладони, упираясь рукой в колено. Выводитькаллиграфические заглавные буквы, рисовать орнаменты тоже было не так просто.'}
        ],
        img:efra
    },
    {
        id:2,
        name:'ФРАНТИШКА УРШУЛЯ РАДЗИВИЛЛ',
        year:'1705 - 1753',
        text:[
            {main:'Единственный ребёнок каштеляна краковского, воеводы виленского, воеводы краковского, старосты пинского князя Януша-Антона Вишневецкого (1678—1741) и его жены Теофилы Лещинской (1680—1757), дочери Вацлава — подчашия королевского, кравчего коронного, воеводы подлясского, старосты ковельского и каменецкого. Получила отличное домашнее образование; овладела несколькими европейскими языками, хорошо знала всемирную литературу, писала стихи. В доме Вишневецких царила творческая атмосфера — отец Франциски был способным оратором и литератором, писал духовные трактаты, панегирики и религиозные песни.'},
            {bio:'Она была единственным ребёнком Теофилы Лещинской и Януша-АнтонаВишневецкого, известного государственного деятеля Речи Посполитой. Девочкаполучила отличное домашнее образование, выучила несколько европейскихязыков, хорошо знала всемирную литературу и писала стихи.В 20 лет Франтишка Уршуля вышла замуж за Михаила Казимира Радзивилла«Рыбоньку», который позже стал великим литовским гетманом. При дворе по еёинициативе появился театр — большая роскошь для того времени, доступнаятолько королям. Для него княгиня сама писала пьесы.Для белорусов и поляковФрантишка Уршуля Радзивилл — первая писательница. Она оставила после себямножество драматургических произведений и около 80 стихотворений. Долгоевремя её имя было известно только в узкой среде, но сейчас произведенияФрантишки Уршули Радзивилл можно свободно прочесть на белорусском языке.'}        
        ],
        img:fran
    },
    {
        id:3,
        name:'ЭМИЛИЯ ПЛЯТЕР',
        year:'1806 - 1831',
        text:[
            {main:'Графиня, революционерка из остзейского дворянского рода по отцовской линии, из Литовской шляхты Браславского повета по материнской. Участница ноябрьского восстания 1830 года, в ходе которого сначала организовала и возглавила небольшой партизанский отряд, а затем была командиром роты литовских пехотинцев в звании капитана.'},
            {bio:'Эмилия Плятер выбрала себе нелёгкую судьбу революционерки. Узнав о восстании вВаршаве, она стала призывать родственников и знакомых начать подготовкувосстания у них, в Литве и Беларуси. И пусть эти планы не осуществились, в девушкеразглядели истинного лидера. Местные дворяне посвятили Эмилию в рыцари-Девы повсем старинным обрядам.29 марта 1831 года Эмилия собрала партизанский отряд. Потом она даже успелаполучить звание капитана — на тот момент это было самое высокое звание, котороемогла получить женщина. Но вскоре Эмилия неожиданно заболела и умерла. Винойстало переутомление, усталость, бессонница, голод и другие лишения, которыепринесла война.Эмилия Плятер смело бросила вызов стереотипу о том, что только мужчины могутвоевать. Нет сомнения, что она заслуживает право называться «белорусской Жаннойд’Арк»'}
        ],
        img:emili
    },
    {
        id:4,
        name:'ЛАРИСА АЛЕКСАНДРОВСКАЯ',
        year:'1904 - 1980',
        text:[
            {main:'Обладая превосходными вокальными данными, как певица начала выступать с 1920 года в труппе театра Главполитпросвета Западного фронта.В 1924—1928 годах училась в Минском музыкальном техникуме, в 1928 — в специальном оперном классе. В 1930—1933 годах занималась в Государственной студии оперы и балета (Минск). Ученица В. А. Цветкова и А. П. Боначича.В 1927 году исполняла белорусские народные песни на Международной музыкальной выставке во Франкфурте-на-Майне (Германия).С 1933 года — солистка Белорусского театра оперы и балета в Минске. Исполняла как сопрановые, так и меццо-сопрановые партии.'},
            {bio:'Белорусская оперная певица обладала уникальными вокальными данными. Еёназывали «белорусским соловьём». Её имя носит детская музыкальная школа искусств№ 1 в Минске. Здесь же, в Минске, и родилась сама Александровская. С детстваувлекалась музыкой, народными песнями, выступала в самодеятельности.Спасаясь от войны, её семья в 1914 году переезжает в Петербург. Там она впервыезнакомится с творчеством профессиональных оперных певцов. А на одном изгимназических вечеров её выступление отметила солистка Мариинской оперы ипредложила начать занятия пением. Но из-за развода родителей Ларисе пришлосьоставить занятия и вернуться в Минск.В 1940 году она получила звание народной артистки СССР. Во время ВеликойОтечественной войны выступала с концертами в госпиталях, партизанских отрядах и нафронте.После войны активно занималась общественной деятельностью'}
        ],
        img:larica
    },
    {
        id:5,
        name:'КОНСТАНЦИЯ БУЙЛО',
        year:'1893 - 1986',
        text:[
            {main:'В 1916 году вышла замуж за Виталия Адольфовича Калечица, сына коллежского советника из застенковой шляхты Минского уезда, впоследствии арестованного в 1933 году.Работала статистиком в Волоколамском райисполкоме, бухгалтером совхоза «Данилково». С 1923 года жила в Москве на квартире мужа в Тихвинском переулке до самой смерти, работала на заводе «Агроном» (1929—1934), начальником отдела сбыта Политехлабсоюза (1934—1940), в 1940—1951 гг. начальник оперативного отдела, позже замдиректора центральной конторы ветеринарного обеспечения треста Союзветзапром.'},
            {bio:'Белорусская поэтесса родилась в Вильно. Её отец, Антон Буйло, служил леснымобъездчиком у графа, мать, Настасья Францевна, занималась домом и детьми, пелав костёльном хоре. Семья жила скромно, но родители с малых лет приучали детейк чтению, науке и музыке. Первой стихотворение Констанции «Лёс» былоопубликовано в газете «Наша нива» (1909), под именем её брата Эдуарда — Э.Буйло.Именно он настоял отправить стихотворение в газету, а чтобы сестра наконецтаки решилась, предложил подписать его своими инициалами.В 1914 году в типографии Мартина Кухты вышла первая книга поэтессы —«Курганная кветка». Её оформлением занимался Язэп Дроздович, а редактировалсам Янка Купала. Деньгами помогла княгиня Мария Магдалена Радзивилл.В 1968 году она получила звание «Заслуженный работник культуры БССР»'}
        ],
        img:buylo
    }
];

export default data;